const startCommandText =
  "سلام! \n این بات موزیک‌های کانال تلگرامتو با پلی‌لیست اسپاتیفایت سینک می‌کنه! \n \n ➊ اول بات رو به کانالت به عنوان مدیر اضافه کن اگر بلد نیستی، روی /help بزن تا راهنماییت کنم \n \n ➋ بعد از اضافه کردن، به اسپوتیفای وصل شو تا سینک بشی \n\n ➌ حالا هر آهنگی بفرستی (چه توی کانالت، چه اینجا) به پلی لیست اسپوتیفایت اضافه‌اش می‌کنم.";

const botIsNotAdminText =
  "❌ ربات در کانال ادمین نیست! لطفاً دسترسی ادمین بده.";

const botIsAdminText = "✅ ربات با موفقیت به عنوان ادمین در کانال اضافه شد!";

const connectToSpotifyText = "🔗 اتصال به Spotify";

module.exports = {
  botIsAdminText,
  startCommandText,
  botIsNotAdminText,
  connectToSpotifyText,
};
