const startCommandText =
  "سلام! \n این بات موزیک‌های کانال تلگرامتو با پلی‌لیست اسپاتیفایت سینک می‌کنه! \n \n ➊ اول بات رو به کانالت به عنوان مدیر اضافه کن اگر بلد نیستی، روی /help بزن تا راهنماییت کنم \n \n ➋ بعد از اضافه کردن، به اسپوتیفای وصل شو تا سینک بشی \n\n ➌ حالا هر آهنگی بفرستی (چه توی کانالت، چه اینجا) به پلی لیست اسپوتیفایت اضافه‌اش می‌کنم.";

const helpCommandText =
  'چطور ربات رو به کانال اضافه کنم؟ \n\n 1. برو به صفحه پروفایل بات  \n 2. گزینه "Add to Group or Channel" رو بزن \n 3. کانالت رو انتخاب کن  \n 4. مطمئن شو دسترسی ارسال پیام فعاله \n 5. ذخیره کن و برگرد اینجا ✅';

const botIsNotAdminText =
  "❌ ربات در کانال ادمین نیست! لطفاً دسترسی ادمین بده.";

const botIsAdminText = "✅ ربات با موفقیت به عنوان ادمین در کانال اضافه شد!";

const connectToSpotifyText = "🔗 اتصال به Spotify";

const addedToSpotifyText = "✅ موزیکت به پلی‌لیست اضافه شد.";

module.exports = {
  botIsAdminText,
  helpCommandText,
  startCommandText,
  botIsNotAdminText,
  addedToSpotifyText,
  connectToSpotifyText,
};
