const startCommandText =
  "سلام! \n این بات موزیک‌های کانال تلگرامتو با پلی‌لیست اسپاتیفایت سینک می‌کنه! \n \n ➊ اول بات رو به کانالت به عنوان مدیر اضافه کن \n \n ➋ بعد از اضافه کردن، به اسپوتیفای وصل شو تا سینک بشی \n\n ➌ حالا هر آهنگی بفرستی (چه توی کانالت، چه اینجا) به پلی لیست اسپوتیفایت اضافه‌اش می‌کنم.";

const aboutCommandText =
  "سایپوتیفای یه بات هوشمنده که بهت کمک می‌کنه آهنگ‌های اسپاتیفای رو جستجو کنی، پلی‌لیست بسازی و مستقیماً از طریق تلگرام به موزیک دسترسی داشته باشی. \n\n ارتباط با توسعه‌دهنده: @metthewk";

const botIsNotAdminText =
  "❌ ربات در کانال ادمین نیست! لطفاً دسترسی ادمین بده.";

const botIsAdminText = "✅ ربات با موفقیت به عنوان ادمین در کانال اضافه شد!";

const connectToSpotifyText = "🔗 اتصال به Spotify";

const addedToSpotifyText = "✅ موزیکت به پلی‌لیست اضافه شد.";

module.exports = {
  botIsAdminText,
  startCommandText,
  aboutCommandText,
  botIsNotAdminText,
  addedToSpotifyText,
  connectToSpotifyText,
};
